{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "D:\\code\\model\\Qwen3-1.7B",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.0",
  "qalora_group_size": 16,
  "r": 4,
  "rank_pattern": {
    "model.layers.0.mlp.down_proj": 9,
    "model.layers.0.mlp.gate_proj": 9,
    "model.layers.0.mlp.up_proj": 9,
    "model.layers.0.self_attn.k_proj": 9,
    "model.layers.0.self_attn.o_proj": 9,
    "model.layers.0.self_attn.q_proj": 9,
    "model.layers.0.self_attn.v_proj": 9,
    "model.layers.1.mlp.down_proj": 10,
    "model.layers.1.mlp.gate_proj": 10,
    "model.layers.1.mlp.up_proj": 10,
    "model.layers.1.self_attn.k_proj": 9,
    "model.layers.1.self_attn.o_proj": 9,
    "model.layers.1.self_attn.q_proj": 9,
    "model.layers.1.self_attn.v_proj": 9,
    "model.layers.10.mlp.down_proj": 14,
    "model.layers.10.mlp.gate_proj": 14,
    "model.layers.10.mlp.up_proj": 15,
    "model.layers.10.self_attn.k_proj": 10,
    "model.layers.10.self_attn.o_proj": 11,
    "model.layers.10.self_attn.q_proj": 11,
    "model.layers.10.self_attn.v_proj": 10,
    "model.layers.11.mlp.down_proj": 14,
    "model.layers.11.mlp.gate_proj": 14,
    "model.layers.11.mlp.up_proj": 16,
    "model.layers.11.self_attn.k_proj": 10,
    "model.layers.11.self_attn.o_proj": 11,
    "model.layers.11.self_attn.q_proj": 11,
    "model.layers.11.self_attn.v_proj": 10,
    "model.layers.12.mlp.down_proj": 14,
    "model.layers.12.mlp.gate_proj": 15,
    "model.layers.12.mlp.up_proj": 16,
    "model.layers.12.self_attn.k_proj": 10,
    "model.layers.12.self_attn.o_proj": 11,
    "model.layers.12.self_attn.q_proj": 11,
    "model.layers.12.self_attn.v_proj": 10,
    "model.layers.13.mlp.down_proj": 14,
    "model.layers.13.mlp.gate_proj": 15,
    "model.layers.13.mlp.up_proj": 16,
    "model.layers.13.self_attn.k_proj": 10,
    "model.layers.13.self_attn.o_proj": 11,
    "model.layers.13.self_attn.q_proj": 11,
    "model.layers.13.self_attn.v_proj": 10,
    "model.layers.14.mlp.down_proj": 14,
    "model.layers.14.mlp.gate_proj": 16,
    "model.layers.14.mlp.up_proj": 16,
    "model.layers.14.self_attn.k_proj": 10,
    "model.layers.14.self_attn.o_proj": 11,
    "model.layers.14.self_attn.q_proj": 11,
    "model.layers.14.self_attn.v_proj": 10,
    "model.layers.15.mlp.down_proj": 14,
    "model.layers.15.mlp.gate_proj": 16,
    "model.layers.15.mlp.up_proj": 15,
    "model.layers.15.self_attn.k_proj": 10,
    "model.layers.15.self_attn.o_proj": 11,
    "model.layers.15.self_attn.q_proj": 11,
    "model.layers.15.self_attn.v_proj": 10,
    "model.layers.16.mlp.down_proj": 15,
    "model.layers.16.mlp.gate_proj": 16,
    "model.layers.16.mlp.up_proj": 15,
    "model.layers.16.self_attn.k_proj": 10,
    "model.layers.16.self_attn.o_proj": 11,
    "model.layers.16.self_attn.q_proj": 11,
    "model.layers.16.self_attn.v_proj": 10,
    "model.layers.17.mlp.down_proj": 16,
    "model.layers.17.mlp.gate_proj": 15,
    "model.layers.17.mlp.up_proj": 15,
    "model.layers.17.self_attn.k_proj": 11,
    "model.layers.17.self_attn.o_proj": 11,
    "model.layers.17.self_attn.q_proj": 12,
    "model.layers.17.self_attn.v_proj": 10,
    "model.layers.18.mlp.down_proj": 17,
    "model.layers.18.mlp.gate_proj": 15,
    "model.layers.18.mlp.up_proj": 15,
    "model.layers.18.self_attn.k_proj": 10,
    "model.layers.18.self_attn.o_proj": 11,
    "model.layers.18.self_attn.q_proj": 11,
    "model.layers.18.self_attn.v_proj": 10,
    "model.layers.19.mlp.down_proj": 17,
    "model.layers.19.mlp.gate_proj": 16,
    "model.layers.19.mlp.up_proj": 14,
    "model.layers.19.self_attn.k_proj": 11,
    "model.layers.19.self_attn.o_proj": 11,
    "model.layers.19.self_attn.q_proj": 12,
    "model.layers.19.self_attn.v_proj": 10,
    "model.layers.2.mlp.down_proj": 11,
    "model.layers.2.mlp.gate_proj": 11,
    "model.layers.2.mlp.up_proj": 10,
    "model.layers.2.self_attn.k_proj": 9,
    "model.layers.2.self_attn.o_proj": 10,
    "model.layers.2.self_attn.q_proj": 9,
    "model.layers.2.self_attn.v_proj": 9,
    "model.layers.20.mlp.down_proj": 17,
    "model.layers.20.mlp.gate_proj": 15,
    "model.layers.20.mlp.up_proj": 14,
    "model.layers.20.self_attn.k_proj": 11,
    "model.layers.20.self_attn.o_proj": 11,
    "model.layers.20.self_attn.q_proj": 12,
    "model.layers.20.self_attn.v_proj": 10,
    "model.layers.21.mlp.down_proj": 19,
    "model.layers.21.mlp.gate_proj": 15,
    "model.layers.21.mlp.up_proj": 14,
    "model.layers.21.self_attn.k_proj": 10,
    "model.layers.21.self_attn.o_proj": 11,
    "model.layers.21.self_attn.q_proj": 11,
    "model.layers.21.self_attn.v_proj": 10,
    "model.layers.22.mlp.down_proj": 19,
    "model.layers.22.mlp.gate_proj": 15,
    "model.layers.22.mlp.up_proj": 14,
    "model.layers.22.self_attn.k_proj": 11,
    "model.layers.22.self_attn.o_proj": 11,
    "model.layers.22.self_attn.q_proj": 12,
    "model.layers.22.self_attn.v_proj": 10,
    "model.layers.23.mlp.down_proj": 19,
    "model.layers.23.mlp.gate_proj": 14,
    "model.layers.23.mlp.up_proj": 13,
    "model.layers.23.self_attn.k_proj": 10,
    "model.layers.23.self_attn.o_proj": 12,
    "model.layers.23.self_attn.q_proj": 12,
    "model.layers.23.self_attn.v_proj": 10,
    "model.layers.24.mlp.down_proj": 19,
    "model.layers.24.mlp.gate_proj": 14,
    "model.layers.24.mlp.up_proj": 13,
    "model.layers.24.self_attn.k_proj": 11,
    "model.layers.24.self_attn.o_proj": 12,
    "model.layers.24.self_attn.q_proj": 11,
    "model.layers.24.self_attn.v_proj": 10,
    "model.layers.25.mlp.down_proj": 18,
    "model.layers.25.mlp.gate_proj": 14,
    "model.layers.25.mlp.up_proj": 13,
    "model.layers.25.self_attn.k_proj": 11,
    "model.layers.25.self_attn.o_proj": 12,
    "model.layers.25.self_attn.q_proj": 11,
    "model.layers.26.mlp.down_proj": 17,
    "model.layers.26.mlp.gate_proj": 14,
    "model.layers.26.mlp.up_proj": 13,
    "model.layers.26.self_attn.k_proj": 11,
    "model.layers.26.self_attn.o_proj": 11,
    "model.layers.26.self_attn.q_proj": 11,
    "model.layers.26.self_attn.v_proj": 10,
    "model.layers.27.mlp.down_proj": 64,
    "model.layers.27.mlp.gate_proj": 14,
    "model.layers.27.mlp.up_proj": 13,
    "model.layers.27.self_attn.k_proj": 11,
    "model.layers.27.self_attn.o_proj": 11,
    "model.layers.27.self_attn.q_proj": 11,
    "model.layers.27.self_attn.v_proj": 10,
    "model.layers.3.mlp.down_proj": 11,
    "model.layers.3.mlp.gate_proj": 12,
    "model.layers.3.mlp.up_proj": 11,
    "model.layers.3.self_attn.k_proj": 9,
    "model.layers.3.self_attn.o_proj": 10,
    "model.layers.3.self_attn.q_proj": 10,
    "model.layers.3.self_attn.v_proj": 9,
    "model.layers.4.mlp.down_proj": 12,
    "model.layers.4.mlp.gate_proj": 13,
    "model.layers.4.mlp.up_proj": 12,
    "model.layers.4.self_attn.k_proj": 9,
    "model.layers.4.self_attn.o_proj": 10,
    "model.layers.4.self_attn.q_proj": 10,
    "model.layers.4.self_attn.v_proj": 9,
    "model.layers.5.mlp.down_proj": 12,
    "model.layers.5.mlp.gate_proj": 12,
    "model.layers.5.mlp.up_proj": 13,
    "model.layers.5.self_attn.k_proj": 10,
    "model.layers.5.self_attn.o_proj": 10,
    "model.layers.5.self_attn.q_proj": 10,
    "model.layers.5.self_attn.v_proj": 9,
    "model.layers.6.mlp.down_proj": 13,
    "model.layers.6.mlp.gate_proj": 13,
    "model.layers.6.mlp.up_proj": 14,
    "model.layers.6.self_attn.k_proj": 10,
    "model.layers.6.self_attn.o_proj": 10,
    "model.layers.6.self_attn.q_proj": 10,
    "model.layers.6.self_attn.v_proj": 10,
    "model.layers.7.mlp.down_proj": 13,
    "model.layers.7.mlp.gate_proj": 14,
    "model.layers.7.mlp.up_proj": 14,
    "model.layers.7.self_attn.k_proj": 10,
    "model.layers.7.self_attn.o_proj": 10,
    "model.layers.7.self_attn.q_proj": 10,
    "model.layers.7.self_attn.v_proj": 10,
    "model.layers.8.mlp.down_proj": 13,
    "model.layers.8.mlp.gate_proj": 14,
    "model.layers.8.mlp.up_proj": 15,
    "model.layers.8.self_attn.k_proj": 10,
    "model.layers.8.self_attn.o_proj": 10,
    "model.layers.8.self_attn.q_proj": 10,
    "model.layers.8.self_attn.v_proj": 9,
    "model.layers.9.mlp.down_proj": 14,
    "model.layers.9.mlp.gate_proj": 14,
    "model.layers.9.mlp.up_proj": 15,
    "model.layers.9.self_attn.k_proj": 10,
    "model.layers.9.self_attn.o_proj": 11,
    "model.layers.9.self_attn.q_proj": 11,
    "model.layers.9.self_attn.v_proj": 10
  },
  "revision": null,
  "target_modules": [
    "q_proj",
    "up_proj",
    "o_proj",
    "down_proj",
    "gate_proj",
    "v_proj",
    "k_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}